## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/66784df8-66e2-4e57-8c28-6202fe27054d).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/core | Success :thumbsup:
**Dir**: layers/core
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmpq0h1bfyl/plan`

```diff
2024-12-02T21:11:56.149Z [INFO]  OpenTofu version: 1.8.4
2024-12-02T21:11:56.150Z [DEBUG] using github.com/hashicorp/go-tfe v1.36.0
2024-12-02T21:11:56.150Z [DEBUG] using github.com/opentofu/hcl/v2 v2.0.0-20240416130056-03228b26f391
2024-12-02T21:11:56.150Z [DEBUG] using github.com/hashicorp/terraform-svchost v0.1.1
2024-12-02T21:11:56.150Z [DEBUG] using github.com/zclconf/go-cty v1.14.4
2024-12-02T21:11:56.150Z [INFO]  Go runtime version: go1.21.11
2024-12-02T21:11:56.150Z [INFO]  CLI args: []string{"/usr/local/lib/tofuenv/versions/1.8.4/tofu", "show", "/tmp/tmpq0h1bfyl/plan"}
2024-12-02T21:11:56.150Z [DEBUG] Attempting to open CLI config file: /github/home/.tofurc
2024-12-02T21:11:56.150Z [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2024-12-02T21:11:56.150Z [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2024-12-02T21:11:56.150Z [DEBUG] ignoring non-existing provider search directory /github/home/.terraform.d/plugins
2024-12-02T21:11:56.150Z [DEBUG] ignoring non-existing provider search directory /github/home/.local/share/terraform/plugins
2024-12-02T21:11:56.150Z [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2024-12-02T21:11:56.150Z [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2024-12-02T21:11:56.150Z [DEBUG] Found the config directory: /github/home/.terraform.d
2024-12-02T21:11:56.150Z [INFO]  CLI command args: []string{"show", "/tmp/tmpq0h1bfyl/plan"}
2024-12-02T21:11:56.246Z [DEBUG] checking for provisioner in "."
2024-12-02T21:11:56.246Z [DEBUG] checking for provisioner in "/usr/local/lib/tofuenv/versions/1.8.4"
2024-12-02T21:11:56.246Z [DEBUG] created provider logger: level=debug
2024-12-02T21:11:56.246Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:11:56.260Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 args=[".terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0"]
2024-12-02T21:11:56.261Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=797
2024-12-02T21:11:56.261Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0
2024-12-02T21:11:56.272Z [INFO]  provider.terraform-provider-cloudflare_v4.47.0: configuring server automatic mTLS: timestamp=2024-12-02T21:11:56.272Z
2024-12-02T21:11:56.287Z [DEBUG] provider.terraform-provider-cloudflare_v4.47.0: plugin address: address=/tmp/plugin1598545125 network=unix timestamp=2024-12-02T21:11:56.287Z
2024-12-02T21:11:56.287Z [DEBUG] provider: using plugin: version=6
2024-12-02T21:11:56.324Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:11:56.326Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/cloudflare/cloudflare/4.47.0/linux_amd64/terraform-provider-cloudflare_v4.47.0 pid=797
2024-12-02T21:11:56.326Z [DEBUG] provider: plugin exited
2024-12-02T21:11:56.326Z [DEBUG] created provider logger: level=debug
2024-12-02T21:11:56.326Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:11:56.332Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null args=[".terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null"]
2024-12-02T21:11:56.332Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=806
2024-12-02T21:11:56.332Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null
2024-12-02T21:11:56.336Z [INFO]  provider.terraform-provider-null: configuring server automatic mTLS: timestamp=2024-12-02T21:11:56.336Z
2024-12-02T21:11:56.351Z [DEBUG] provider.terraform-provider-null: plugin address: address=/tmp/plugin4148398274 network=unix timestamp=2024-12-02T21:11:56.351Z
2024-12-02T21:11:56.351Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:11:56.363Z [DEBUG] No provider meta schema returned
2024-12-02T21:11:56.363Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:11:56.364Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.opentofu.org/hashicorp/null/3.2.3/linux_amd64/terraform-provider-null pid=806
2024-12-02T21:11:56.364Z [DEBUG] provider: plugin exited
2024-12-02T21:11:56.364Z [DEBUG] created provider logger: level=debug
2024-12-02T21:11:56.364Z [INFO]  provider: configuring client automatic mTLS
2024-12-02T21:11:56.370Z [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 args=[".terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1"]
2024-12-02T21:11:56.370Z [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=815
2024-12-02T21:11:56.370Z [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1
2024-12-02T21:11:56.424Z [INFO]  provider.terraform-provider-akash_v0.1.1: configuring server automatic mTLS: timestamp=2024-12-02T21:11:56.424Z
2024-12-02T21:11:56.443Z [DEBUG] provider: using plugin: version=5
2024-12-02T21:11:56.443Z [DEBUG] provider.terraform-provider-akash_v0.1.1: plugin address: address=/tmp/plugin3032157255 network=unix timestamp=2024-12-02T21:11:56.443Z
2024-12-02T21:11:56.464Z [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2024-12-02T21:11:56.625Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x8b     \xff\x94Ukh\xd7\xd9\xfeVڕ\x8eV\x97}\xb5\x92V\xafW\xb7\xd1\xd1m\xa5X3ڑ\xe5X\x89\xe3϶\xec\xd64u\x95)\xa5!\xa8\xe3٣\xd5\xe0\xd1\xcc\xf6\xcc\xec\xda\xfa\xb7\x854u\xfe4\x85\xb6P腚\xbaP\xf0%\xd8qppchij0q\x83\xeb\xd2bh\x89i\xb0C\xc5?\xeaP\xba\xe5\x9c\xd9]\xadlUv~H\xec\x9e\xe7y\x9f\xf7r\xde\xf3\xec\x81o\xbdy㭻o\xfc\xed5\x8c\x86I\xea\xa2aR\xe1\xf9_\x9d\xbf\xbd\xf8u\xf9\xf1\xc53\xb7\xc3Ho\x9c\xfeC=\x8d\x90\xfc\xa7	B\x84\x84 \x82\xa5\x81&H~\xe7\xf2\xb5z&u\xc0i\x84\xd4\xc3ݐd\xd4A#6*d\x82\x90zh\xc2&%J\x81\xd4\xe3\xbbw\xaf	\x9d0\x9c\xa8\x93\xac04c\xb3\xc4\xc2\xf8\xdao\xae,?I,-آ\xb4R <q\xe7\xa6\xc0\xe0\xdbA\\xb4a\x9b\xa3	Ҁ\xbf\xff\xf0\xa6\xc8\xdf@#\x84\xc0\xa7At# \x82\xd2>A\x818ƕ\x8d\x91F<\xfb\xbe\xe46\x81#S4Av(1
2024-12-02T21:11:56.625Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x84\xe0?\xef\xdf)\xa2p\xb6EbQ\xe8\xc4N\xa5\x8b\xc6H\x9e\xb9u2Bä\xd2j\x86&\x94n
2024-12-02T21:11:56.625Z [DEBUG] provider.terraform-provider-akash_v0.1.1: $\x8a\x97.\xfc2B#\xa4\xce\x95\xb5 "*[(\x90f\xbc\xfa\x8b\xd3k\x85\x8b\xd6
2024-12-02T21:11:56.625Z [DEBUG] provider.terraform-provider-akash_v0.1.1: IL*=H^\xbc|A`mp>\xa8\xb7z\xb1W\xe9\xa31Ҋ\xa7\xcf]\xe9bP\x90\xe9bЏ\xfdj\xc3;g\xee\xb5\xd20\x88K` \x85\x89ṛ߭\xa3\xd2\xc5v\xc4A\x85\xc6B .2\xd5Շ#\x8d\xa4)\xda\xdc\xd2\xda&\xda\xfc\xe9\xebWE\xdbq\xf8G\xbbT\x8c\xc3ɛm\xc7W/]\x93\xed\x80cT\xdc\xec\xad@\xb7\x86qX!H\xf2q\xf9>O\xd7A\x88\xc6H\x9e\xf8\xd3G"\xa6\xf2R\xaeFpD\xa5	҉\x97\x8f?P\xd1I\xc0߃\xa1t\xc1\x8e)\xa3\x84$ \x85)e\x9c\xe9\xc2\xd7?\xfb\xb7(\xabN\xacn\x98\xc0	\x89%\xf0ae\xe4b\xac\xf1D\xa5\xbdVh\x8f\x87;:\xbb\x95\xe6\xba\xf1\xc7\xf7\xdf*!\xf8YB4Ao\xbc%[
2024-12-02T21:11:56.625Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \x96\xe1\xd7AK\xcf\xe03r\xb7\xe0\xd5;\xe5\x96΋\x96\x80$\xf1\xf8;r1\xb7\xc0{lŭr1{\xf0\x87\xf7\xe4b&ὠ\xce$L\xe2\xa4\\xcc^<\xf5\x89\\xb6\xe8\xa4\xd2gF\xa8\xa8\xca\xc5\xec5\xb9}}x\xf2\xbe\xd4\xe9\x83VL\xe1\x94\\xda~\xfc냏\xc5\xdc\xfa\xa1O\x8e\xb4ҘVt
2024-12-02T21:11:56.625Z [DEBUG] provider.terraform-provider-akash_v0.1.1: d _\xbd\xf5\x99hp \xae4Hl \xa6qZ\xd9FcD\xc1\xb7\xff|_\x84)\xf0%	)0\x833\xc47O\xfdK@\x83\xb0]B\x83\xb0\xb7+\xcfR \xdf\xff\xed\xa7B\x91f\x89Q؁;\x94Y\xdaG\x86\xf0\xfb'?
2024-12-02T21:11:56.625Z [DEBUG] provider.terraform-provider-akash_v0.1.1: \xd3\x82\x87Q!\xc3\xf0I\x94\x86\xc9x ,a\x9e\xc3\xe7\x94\xd9	B\x86\xe1y|^~\x81\x9d\xb8Sy\x81\xc6KW\x88\xe0Q\xf8^0\xc5Q؅\xbb\x94\xff\xa7@F\xf0\xdd\xdb?\x8fam\x8c\xc1nܭ\xec\xa1@F\xf1\xed\xbfH,\xb0\xecŽ\xc3\xdfݐ\xd8x\xa5\xfdq\x98\xc39eO<Yى\xf6nܒ\xec\xe9\xed\xebP\xe9\xd0\xf0\xc8\xe8XH\x8a\xc5b\xaf\xdckM\xed\xdbJv\x92:(^\xb9\xf8\xc1\xf5\xd2 \x8b\xef|p\xbd4\x90ڟL\x92z(\x8bK\xa5R\xa9\xc2\xe2ϋK\xa5R\xa9J}A\xff?\xbd\xd13Vr6\xf3\xf4\x88\xe9\xe6_\xaf7sy\xbd\xd91\xd7c\xa6\xebd<}\xc4\xe4\xab9\xdf՘m[9\xdf25\xcb\xf1w[[\xb2_\xcd\xcd\xe8\xe9\x83y[\xdfj\xf2MhZnFO/.Y\x86\xbf}\x9b\x9au\xf5)\x93o\xc2VS\xf33zz\xbf\xcdV\x98㏫\xf3\xf6ʐ\xfaBx\xfa
2024-12-02T21:11:56.628Z [DEBUG] provider.terraform-provider-akash_v0.1.1: ;\x96\xe73\xb3,=\xefZBx\x9f\x9b?l3}\xec	AU\xf5g\x9f@\\xaf\xbe`\xb6\xc1\xe6m_O=\xa8\x8ay\xcc\xe5y\x81\x95Y{\x8fIf\xf7#\xccjn\xac f\xc63T\xcf\xca:_d㖩w\xd5"Z\x80g]\xbd\xbd\xf6X\xe8=\xb5Gs\xd1qo\xe5q\xfe\x82\x95u\xf4\x81Z\xbeh\x8e[\xc3g/\xb2\xd5\xf1\x80\xd0W&\x9b\x99\x9aU\xe783|6Ǹo-Y\xa6\xe13\xbd\xa38YW&k\xf9\xcb\xf9ê\xe9\xaehˆ\xb7l\x99.\xcfiYw2g糖\xa3f\x99ø铛\x93w\xd2\xea6u\x9b\xb6\xe2۞\xd0ޜ\xae.0^`\xba\xb69\xab"\xea	2\xb2{7\xf0\xe7ƒ\xcbWʕOf]\xcd_\xcaq\xd7w3\x9a\xbf4S\x92|Z\x8d݅)uVMo$\xf5\xf9K\xf22G\xb4\x82\xae\x95G[\xad)(i\xdfӕh\xec.\xe8j\xfaYu\xaa\xac\x94"\x863\xfbyT\xca\xd1\xe5\x994\xad\x96\xa3\x8a\xbaR3M\xee\xac\xe3\x93\xc6\xc3[\xd6,\xf2\xb4\xf0\xbc\xe3[+,\xe0\xc7\xcaߴwM?\xfaĴ\xc7}j\xe1\x9by\x83\xb3M<bI8\xda#\xe6SZ\xb7\xe99\x83{l\xff\xdc\xdasX\xbf\xe93\xa5\xad\x8b\x99,&Y~bw\xa5b\x8d^\xe5\xf1\xfa\xb6'\xfeD\x83\x89\xfa\xd7f\xa6f_d\xab\xf3\x86\xc57\xf1ҍ,oO&\xa3\x97\x95\x98m[\xc2\xd2s#\xe9D\x95\xf2C)0n-\xadV,\xa7\xf2\xb0k\xb1G\xbf*\xd6\xfcL\xdaVp\xb8gᥴ>T.Bt\x880\x9c\x8c\xb7la\xc2{?ϙ_#iF\xde_V\xb3\xae\xfe\xc2ڙ\x9a\x9a\xde\xd8Z\xa8o\xf8\xecЗ\xd2\xd3\xe3*gFfζ\x98\xe3\xd7zR\xa5y1\xd9\xe5J\xc6\xc5@fѷ\xbd\xf4\xb4H\x92~\xda$U	\x9d\xae\x99sg\d\xab\xd5\xe9\xfdk\x9cǒ\x8b\xb4\xb5CI\x955\xaa\xe6\\xc7g\xc7\xfcuC1]G>\x8e\x8d\xabi+\x81\xbdk٫\xeaU\x92\xbe+\xeb\xbaY[<i\xdbp\xb2\xaa˳Z\x96\xe7L\xcd\xe4,\xc3\xdf2l\xe5\xdb\xdego<x\xc25\xbd\xa57\x8e\x97n\xbaC\x9d\xaa\xd5\xc3\xed\xee\xdc8d\xed\xe9\xfa\xdcp\xbc\x9c\xcb}\xf5%vT\x9a?T9\xd2\xf7l]MX5\x80\xaa\x8a\xb6\xec\xfb9\xbd|٢ }c	55$Wv\xf4\xc0\xa1C\xf3\xfaZ\xda\xd4\xc61մ\xc1\x9duucf\x8d\xba\xb8[\x9b}\xc58*\xd6E\xdf\xfaD\xbe\xacJ]\xca;\xe6\xb4~<T\xfeӎ\xba\xfc\x88\x973L\xa6\xd9\xc6*\xe3\x9ef\xba\x9cij\xd5Q\x85GJG\xf54β\x96\xe7\xf3\xd55P\xb5\\xcdί\xb0\xa3\xec\xb0VӚm9\xf9c\x8b\xc6Jf\xfb\xb6\xda_\xbau޼X\x90\\xbd\xe1\xe5B\xc6s_ѣ/\xbcU\xcf4l\xfb\x95\xff  \xff\xff2O\xc9z\x95  
2024-12-02T21:11:56.628Z [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/***/akash/0.1.1/linux_amd64/terraform-provider-akash_v0.1.1 pid=815
2024-12-02T21:11:56.628Z [DEBUG] provider: plugin exited

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = []
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
